# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака. Объяснить полученный результат.

a = 5
b = 6

print(f'{a} = {bin(a)}')
print(f'{b} = {bin(b)}')
print(f'не {a} = {~a} = {bin(~a)}')
print(f'не {b} = {~b} = {bin(~b)}')
print(f'{a} И {b} = {a & b} = {bin(a & b)}')
print(f'{a} ИЛИ {b} = {a | b} = {bin(a | b)}')
print(f'{a} исключающее ИЛИ {b} = {a ^ b} = {bin(a ^ b)}')
print(f'побитовый сдвиг вправо {a} = {a >> 2} = {bin(a >> 2)}')
print(f'побитовый сдвиг влево {a} = {a << 2} = {bin(a << 2)}')
